# Formas de seleções

In [1]:
import pandas as pd

In [4]:
data = [(1, 2, 3, 4),
        (5, 6, 7, 8),
        (8, 10, 11, 12),
        (13, 14, 15, 16)]
df = pd.DataFrame(data, 'l1 l2 l3 l4'.split(), 'c1 c2 c3 c4'.split())

In [ ]:
lista = list('1 2 3 4 5'.split()) # Split separa valores que ja estajam separado por um spaço em posições numa lista ou array
lista

In [8]:
df

    c1  c2  c3  c4
l1   1   2   3   4
l2   5   6   7   8
l3   8  10  11  12
l4  13  14  15  16

In [12]:
df['c1'] # selecionando apenas uma coluna e criando uma Series

l1     1
l2     5
l3     8
l4    13
Name: c1, dtype: int64

In [13]:
df[['c1', 'c2']] #selecionando mais de uma coluna simultanemente fazendo dessa seleção um DataFrame

    c1  c2
l1   1   2
l2   5   6
l3   8  10
l4  13  14

In [15]:
df[:] #selecionando todas as linhas

    c1  c2  c3  c4
l1   1   2   3   4
l2   5   6   7   8
l3   8  10  11  12
l4  13  14  15  16

In [17]:
df[0:2] # selecionando da linha 0 a linha 1

    c1  c2  c3  c4
l1   1   2   3   4
l2   5   6   7   8

In [20]:
df[1:][['c3', 'c1']] #selecionando da linhas 1 ao final, somente as colunas 'c3' e 'c1'

    c3  c1
l2   7   5
l3  11   8
l4  15  13

In [21]:
df.loc['l3'] #loc seleciona o bloco da linha, nesse caso 'l3' referece a posição do indice que tem l3 em relação a linha

c1     8
c2    10
c3    11
c4    12
Name: l3, dtype: int64

In [24]:
df.loc[['l1', 'l2']] #selecionando apenas os blocos de da linha 1 e  2

    c1  c2  c3  c4
l1   1   2   3   4
l2   5   6   7   8

In [27]:
df.iloc[1, 2] #  o iloc entende o DataFrame como uma matriz onde as linhas e colunas sao deinidas numericamente
#no caso acima, o valor  foi sete pois ele selecionou a linha 1 e o valor de posição 2

7

In [30]:
df

    c1  c2  c3  c4
l1   1   2   3   4
l2   5   6   7   8
l3   8  10  11  12
l4  13  14  15  16

In [33]:
df.sort_values(by = ['c3'])

    c1  c2  c3  c4
l1   1   2   3   4
l2   5   6   7   8
l3   8  10  11  12
l4  13  14  15  16